{
    "languages": {
        "Українська": "ua",
        "Русский": "ru",
        "English": "en"
    },
    "ru": {
        "about": "О программе",
        "aboutTitle": "Про",
        "author": "Автор",
        "results": "Результаты поиска:",
        "book": "Книга",
        "changesDetected": "Обнаружены изменения. Не забудьте сохраниться",
        "copyright": "\"Flibusta\" Client v0.1 - \"flibusta.net\" site client\nCopyright(C) 2022 Ruslan Popov <ruslanpopov1512@gmail.com>",
        "emptyQuery": "Вы ввели пустой запрос",
        "experimental": "Экспериментальные функции",
        "help": "Помощь",
        "isSaveToDir": "Всегда спрашивать меня, куда сохранять файлы",
        "language": "Язык:",
        "languageWarning": "Смена языка произойдет только после перезагрузки программы",
        "name": "Название",
        "query": "Запрос:",
        "saveDir": "Папка загрузок:",
        "saveSettings": "Сохранить",
        "search": "Поиск",
        "selectDir": "Открыть",
        "selfLanguage": "Русский",
        "settings": "Настройки",
        "title": "Клиент \"Флибусты\"",
        "type": "Искать:",
        "undone": "ДАННАЯ ЧАСТЬ ПРОГРАММЫ НЕ ДОДЕЛАНА",
        "backward": "Назад",
        "forward": "Вперед",
        "currentQuery": "Текущий запрос:",
        "bookFormat": "Предпочитаемый формат:",
        "downloadBook": "Скачать",
        "downloading": "Скачивание..",
        "viewAuthor": "Просмотреть книги этого автора",
        "sDownloadBook": "Скачать в...",
        "downloadAllBooks": "Скачать все книги автора",
        "sDownloadAllBooks": "Скачать все книги автора в...",
        "openInBrowser": "Открыть в браузере...",
        "wait": "Пожалуйста подождите",
        "error": "Ошибка",
        "errorOccurred": "Во время загрузки возникла ошибка",
        "downloadSelected": "Скачать выбранное",
        "searchCompleted": "Поиск окончен. Результатов: ",
        "ready": "Готов",
        "aboutText": "Описание:\nflibustaClient - попытка создать клиент сайта \"Флибуста\".  \nНаписан на языке Python с использованием Tkinter. \nПрограмма не претендует на качественную и полноценную работу.\n\nВозможности:\n- Поиск книг и авторов\n- Скачивание книг в выбранном формате\n- Возможность скачать все книги автора\n- Просмотр книг автора\n- Поддержка различных языков\n- Автоматически разархивирует запакованные загрузки\n\nОграничения:\n- Отсутствие в ряде случаев обработчиков различных ошибок\n- Формат выбирается в настройках и только один (нет возможности выбрать формат для конкретной книги)\n- Если возникла проблема со скачиванием одной книги, то об этом никак не уведомляется\n- Просмотр книг автора поддерживается только при поиске авторов\n- Нет обработки (сортировки, выбора, просмотра) серий\n- Нет возможности настроить подключение (выбор зеркала, Tor, VPN)\n- При отсутствии результатов поиска выдаёт \"мусор\"",
        "helpText": "1. Поиск книг\n\tДля того, чтобы найти конкретную книгу, в поле поиска введите её название (без ошибок), нажмите на круглую кнопку \"Книга\" и на кнопку \"Поиск\". В таблице будут выведены результаты поиска. Для того, чтобы скачать книгу из списка, нажмите на неё правой кнопкой мыши. Возникнет контекстное меню, в котором будет пункт \"Скачать\". Когда вы нажмёте на пункт, будет скачана книга в выбранном по умолчанию формате (в данной версии нельзя выбрать формат для конкретной книги).\n\tЕсли вы хотите скачать несколько книг (например, у книги несколько томов), тогда кликните левой кнопкой мыши два раза по каждой книге (строчке), которую вы хотите скачать. После выбора нажмите на кнопку \"Скачать выбранное\".\n\n2. Поиск авторов\n\tДля того, чтобы найти опредлённого автора на \"Флибусте\", в поле поиска введите его имя (без ошибок), нажмите на круглую кнопку \"Автор\" и на кнопку \"Поиск\". В таблице будут выведены результаты поиска. \n\tНажав правой кнопкой мыши на автора, вы можете открыть его страницу в браузере, просмотреть его книги или скачать все его книги.\n\tПри просмотре книг автора \"Флибуста\" выделяет \"серии\", их название находится в правой колонке и отделено от остальных книг множеством дефисов. Корректность книг из серии не гарантируется.\n\n3. Настройки\n\tВ этом окне вы можете настроить путь, по которому будут сохраняться по умолчанию книги (или заставить программу всегда спрашивать этот путь при скачивании). Доступен выбор языка.\n\tПункт выбора формата книги обязателен. Когда вы загружаете какие-либо книги, они будут загружаться именно в этом формате. В данной версии нет возможности выбрать конкретный формат для конкретной книги. При невозможности скачать опредлённую книгу, программа не сообщит об этом.\n\n"
    },
    "ua": {
        "about": "About",
        "aboutTitle": "Про",
        "author": "Автор",
        "results": "Результати пошуку:",
        "book": "Книга",
        "changesDetected": "Відбулися зміни. Не забудьте зберегти",
        "copyright": "\"Flibusta\" Client v0.1 - \"flibusta.net\" site client\nCopyright(C) 2022 Ruslan Popov <ruslanpopov1512@gmail.com>",
        "emptyQuery": "Ваш запит порожній",
        "experimental": "Експериментальні функції",
        "help": "Допомога",
        "isSaveToDir": "Завжди питати мене, де зберігати файли",
        "language": "Мова:",
        "languageWarning": "Зміна мови відбудеться тільки після перезавантаження програми",
        "name": "Назва",
        "query": "Запит:",
        "saveDir": "Папка зберігання:",
        "saveSettings": "Зберегти",
        "search": "Пошук",
        "selectDir": "Відкрити",
        "selfLanguage": "Українська",
        "settings": "Налаштування",
        "title": "Клієнт \"Флібусти\"",
        "type": "Шукати:",
        "undone": "ДАНА ЧАСТИНА ПРОГРАММИ НЕДОРОБЛЕНА",
        "backward": "Назад",
        "forward": "Вперед",
        "currentQuery": "Історія пошуку:",
        "bookFormat": "Формат книги:",
        "downloadBook": "Скачати",
        "downloading": "Скачування..",
        "viewAuthor": "Подивитися книги цього автора",
        "sDownloadBook": "Зберегти в...",
        "downloadAllBooks": "Скачати усі книги цього автора",
        "sDownloadAllBooks": "Скачати усі книги цього автора в...",
        "openInBrowser": "Відкрити у браузері...",
        "wait" : "Будь ласка почекайте",
        "error": "Помилка",
        "errorOccurred": "Під час завантаження виникла помилка",
        "downloadSelected": "Скачати вибране",
        "searchCompleted": "Пошук завершено. Результатів: ",
        "ready": "Готовий",
        "aboutText": "Опис:\nflibustaClient – спроба створити клієнт сайту \"Флібуста\".\nНаписаний мовою Python із використанням Tkinter.\nПрограма не претендує на якісну та повноцінну роботу.\n\nМожливості:\n- Пошук книг та авторів\n- Завантаження книг у вибраному форматі\n- Можливість завантажити всі книги автора\n- Перегляд книг автора\n- Підтримка різних мов\n- Автоматично розархівує запаковані завантаження\n\nОбмеження:\n- Відсутність у ряді випадків обробників різних помилок\n- Формат вибирається в налаштуваннях і лише один (немає можливості вибрати формат для конкретної книги)\n- Якщо виникла проблема зі скачуванням однієї книги, то про це ніяк не повідомляється\n- Перегляд книг автора підтримується лише під час пошуку авторів\n- Немає обробки (сортування, вибору, перегляду) серій\n- Немає можливості налаштувати підключення (вибір дзеркала, Tor, VPN)\n- За відсутності результатів пошуку видає \"сміття\"",
        "helpText": "1. Пошук книг\n\tДля того, щоб знайти конкретну книгу, введіть її назву (без помилок) у полі пошуку, натисніть на круглу кнопку \"Книга\" і на кнопку \"Пошук\". У таблиці буде виведено результати пошуку. Щоб скачати книгу зі списку, натисніть на неї правою кнопкою миші. Виникне контекстне меню, в якому є пункт \"Завантажити\". Коли ви натиснете на цей пункт, буде завантажена книга у вибраному за замовчуванням форматі (у цій версії не можна вибрати формат для конкретної книги).\n\tЯкщо ви хочете завантажити декілька книг (наприклад, у книги кілька томів), тоді клацніть лівою кнопкою миші двічі по кожній книзі (рядку), яку ви хочете завантажити. Після вибору натисніть кнопку \"Завантажити вибране\".\n\n2. Пошук авторів\n\tДля того, щоб знайти певного автора на \"Флібусті\", введіть його ім'я (без помилок) у полі пошуку, натисніть на круглу кнопку \"Автор\" і на кнопку \"Пошук\". У таблиці буде виведено результати пошуку.\n\tНатиснувши правою кнопкою миші на автора, ви можете відкрити його сторінку в браузері, переглянути його книги або завантажити всі книги.\n\tПри перегляді книг автора \"Флібуста\" виділяє \"серії\", їхня назва знаходиться у правій колонці та відокремлена від інших книг безліччю дефісів. Коректність книг із серії не гарантується.\n\n3. Налаштування\n\tУ цьому вікні ви можете налаштувати шлях, за яким зберігатимуться за замовчуванням книги (або можна змусити програму завжди запитувати цей шлях при завантаженні). Доступний вибір мови.\n\tПункт вибору формату книги є обов'язковим. Коли ви завантажуєте будь-які книги, вони завантажуватимуться саме в цьому форматі. У цій версії немає можливості вибрати конкретний формат конкретної книги. За неможливості завантажити означену книгу, програма не повідомить про це.\n\n"
    },
    "en": {
        "about": "About",
        "aboutTitle": "About",
        "author": "Author",
        "results": "Searching results:",
        "book": "Book",
        "changesDetected": "Changes Detected. Don't forget to save",
        "copyright": "\"Flibusta\" Client v0.1 - \"flibusta.net\" site client\nCopyright(C) 2022 Ruslan Popov <ruslanpopov1512@gmail.com>",
        "emptyQuery": "Your input is empty",
        "experimental": "Experimental functions",
        "help": "Help",
        "isSaveToDir": "Always ask me where to save files",
        "language": "Language:",
        "languageWarning": "Language will change after program restart",
        "name": "Name",
        "query": "Query:",
        "saveDir": "Downloads folder:",
        "saveSettings": "Save",
        "search": "Search",
        "selectDir": "Open",
        "selfLanguage": "English",
        "settings": "Settings",
        "title": "\"Flibusta\" Client",
        "type": "Search for:",
        "undone": "THIS PART OF PROGRAM IS UNDONE",
        "backward": "Backward",
        "forward": "Forward",
        "currentQuery": "Current query:",
        "bookFormat": "Book format:",
        "downloadBook": "Download",
        "downloading": "Downloading...",
        "viewAuthor": "View author books",
        "sDownloadBook": "Download in..",
        "downloadAllBooks": "Download all books of this author",
        "sDownloadAllBooks": "Download all books of this author in...",
        "openInBrowser": "Open in browser...",
        "wait": "Please wait",
        "error": "Error",
        "errorOccurred": "Error occurred while downloading",
        "downloadSelected": "Download selected",
        "searchCompleted": "Search completed. Results: ",
        "ready": "Ready",
        "aboutText": "Description:\nflibustaClient - an attempt to create client of site \"Flibusta\".\nWritten in Python using Tkinter.\nThe program does not claim to be of high quality and complete work.\n\nCapabilities:\n- Search for books and authors\n- Download books in the selected format\n- Ability to download all the books of the author\n- View author's books\n- Support for various languages\n- Automatically unzips packed downloads\n\nRestrictions:\n- Absence in some cases of various error handlers\n- The format is selected in the settings and only one (there is no way to select a format for a particular book)\n- If there is a problem with downloading one book, then this is not notified in any way\n- Viewing books by an author is only supported when searching for authors\n- No processing (sorting, selection, viewing) of series\n- There is no way to configure the connection (selection of a mirror, Tor, VPN)\n- If there are no search results, it gives \"garbage\"",
        "helpText": "1. Search for books\n\tIn order to find a specific book, enter its name in the search field (without mistakes), click on the round button \"Book\" and click on the \"Search\" button. The table will display the search results. \n\tTo download a book from the list, right-click on it. A context menu will appear with the \"Download\" item. When you click on this item, the book will be downloaded in the default format (in this version, you cannot select the format for a particular book).\n\tIf you want to download several books (for example, a book has several volumes), then double-click on each book (line) you want to download. Once selected, click on the \"Download Selected\" button.\n\n2. Search for authors\n\tIn order to find a certain author on \"Flibusta\", enter his name in the search field (without mistakes), click on the round button \"Author\" and on the \"Search\" button. The table will display the search results.\nBy right-clicking on author, you can open his page in a browser, view his books, or download all of his books.\n\tWhen viewing the books of the author, \"Flibusta\" highlights the \"series\", their name is in the right column and is separated from the rest of the books by many hyphens. The correctness of the books in the series is not guaranteed.\n\n3. Settings\n\tIn this window, you can set the path where books will be saved by default (or force the program to always ask for this path when downloading). Language selection available.\n\tThe book format selection item is required. When you download any books, they will be downloaded in this format. In this version, it is not possible to select a specific format for a specific book. If it is impossible to download a certain book, the program will not inform you about it.\n\n"
    }
}